In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
dados = {'Nome': ['Joelande','Jociara', 'Basilio', 'Mahysa', 'Carlos', 'João Paulo', 'Nilton', 'Ana Paula', 'Hermilino Danilo', 'Paulo Tadeu', 'Evaldo', 'Fernando' , 'Lorena', 'Jailza'],
        'Idade': [14, 18, 15, 13, 19, 13, 18, 16, 19, 14, 16, 18, 17, 14]
}

In [14]:
df = pd.DataFrame(dados)
df.head()

       Nome  idade
0  Joelande     14
1   Jociara     18
2   Basilio     15
3    Mahysa     13
4    Carlos     19

In [11]:
x = np.random.randint(low=12, high=20, size=14)
print(x)

[14 18 15 13 19 13 18 16 19 14 16 18 17 14]

In [8]:
l1 = ['Joelande','Jociara', 'Basilio', 'Mahysa', 'Carlos', 'João Paulo', 'Nilton', 'Ana Paula', 'Hermilino Danilo', 'Paulo Tadeu', 'Evaldo', 'Fernando' , 'Lorena', 'Jailza']

In [9]:
len(l1)

14